{"class_name": "Functional", "config": {"name": "model_288", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_577"}, "name": "input_577", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 12], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_578"}, "name": "input_578", "inbound_nodes": []}, {"class_name": "LSTM", "config": {"name": "lstm_288", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 100, "activation": "relu", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 2}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 3}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 4}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "lstm_288", "inbound_nodes": [[["input_577", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_576", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_576", "inbound_nodes": [[["input_578", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_576", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_576", "inbound_nodes": [[["lstm_288", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_577", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_577", "inbound_nodes": [[["dense_576", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_288", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_288", "inbound_nodes": [[["dropout_576", 0, 0, {}], ["dropout_577", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_577", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_577", "inbound_nodes": [[["concatenate_288", 0, 0, {}]]]}], "input_layers": [["input_577", 0, 0], ["input_578", 0, 0]], "output_layers": [["dense_577", 0, 0]]}, "keras_version": "2.12.0", "backend": "tensorflow"}